const {parseEbTitle} = require("../client/functions");

let testcases = [
  // "といつめる〔問い詰める〕",
  // "どいつ{何奴}",
  // "ドイツ【Duits（land） オランダ・独逸】",
  // "ドイツ‐あやめ【ドイツ菖蒲】",
  // "千里(せんり)の行(こう)も足下(そっか)より始(はじ)まる",
  // "【何奴此奴】どいつこいつ　《不定称》",
  // "人心地(ひとごこち)がつく",
  // "といつめる【問い詰める】【問詰める】トヒツメル[4]:[4]",
  "からだ【体・躰・身体】",
];

testcases.forEach(testcase => {
  console.log(testcase, parseEbTitle(testcase));
});


"千里(せんり)の行(こう)も足下(そっか)より始(はじ)まる".match(/(.*?)(【(.*?)】|〖(.*?)〗|{(.*?)}|（(.*?)）|〔(.*?)〕|\((.*?)\))?/ig)


[keyword]いちょう-がしら[/keyword] イチヤウ― [4] 【銀杏頭】↵江戸時代の男の髪形の一。髷(マゲ)の先をイチョウの葉のように平たく広げたもの。↵[mono width=200,height=256]銀杏頭[/mono page=177736,offset=1344][図]↵